In [1]:
import pandas as pd

In [3]:
var1=pd.DataFrame({'A':[1,2,3],'B':[2,3,5]})
var2=pd.DataFrame({'A':[1,2,3],'C':[4,7,8]})

In [4]:
pd.merge(var1,var2)

   A  B  C
0  1  2  4
1  2  3  7
2  3  5  8

In [5]:
var1=pd.DataFrame({'A':[1,2,3,4],'B':[2,3,5,8]})
var2=pd.DataFrame({'A':[1,2,3,5],'C':[4,7,8,8]})

In [6]:
pd.merge(var1,var2)

   A  B  C
0  1  2  4
1  2  3  7
2  3  5  8

In [7]:
pd.merge(var1,var2,how='left')

   A  B    C
0  1  2  4.0
1  2  3  7.0
2  3  5  8.0
3  4  8  NaN

In [8]:
pd.merge(var1,var2,how='right')

   A    B  C
0  1  2.0  4
1  2  3.0  7
2  3  5.0  8
3  5  NaN  8

In [9]:
pd.merge(var1,var2,how='outer')

   A    B    C
0  1  2.0  4.0
1  2  3.0  7.0
2  3  5.0  8.0
3  4  8.0  NaN
4  5  NaN  8.0

In [11]:
pd.merge(var1,var2,how='outer',indicator=True)

   A    B    C      _merge
0  1  2.0  4.0        both
1  2  3.0  7.0        both
2  3  5.0  8.0        both
3  4  8.0  NaN   left_only
4  5  NaN  8.0  right_only

In [12]:
var1=pd.DataFrame({'A':[1,2,3],'B':[2,3,5]})
var2=pd.DataFrame({'A':[1,2,3],'B':[4,7,8]})

In [15]:
pd.merge(var1,var2,left_index=True,right_index=True)

   A_x  B_x  A_y  B_y
0    1    2    1    4
1    2    3    2    7
2    3    5    3    8

In [18]:
pd.merge(var1,var2,left_index=True,right_index=True,suffixes=(' name',' id'))

   A name  B name  A id  B id
0       1       2     1     4
1       2       3     2     7
2       3       5     3     8